src/cf/InformationRegisters/ПодразделенияТорговыхТочек.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.10">
	<InformationRegister>
		<Properties>
			<Name>ПодразделенияТорговыхТочек</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ТорговаяТочка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.вогТорговыеТочки</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Направление</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НаправленияДеятельности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЕстьБрендМенеджер</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>БрендМенеджер</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/InformationRegisters/вогМенеджерыОбъектов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.10">
	<InformationRegister>
		<Properties>
			<Name>вогМенеджерыОбъектов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЕстьБрендМенеджерВТТ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Владелец</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.вогВладелецМенеджеров</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Роль</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РолиКонтактныхЛицПартнеров</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НаправлениеДеятельности</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НаправленияДеятельности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Менеджер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>БрендМенеджер</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/InformationRegisters/CRM_ОбъектыЗначенийКлассификаторов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.10">
	<InformationRegister>
		<Properties>
			<Name>CRM_ОбъектыЗначенийКлассификаторов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ЗначениеРеквизита</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.CRM_ДополнительныеРеквизитыКлассификаторов</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ДатаВключения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХранитьИсториюИзменения</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбъектРегистратор</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.вогАнкета</v8:Type>
						<v8:Type>cfg:BusinessProcessRef.CRM_БизнесПроцесс</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.CRM_Классификаторы</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Аналитика</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.CRM_АналитикаКлассификаторов</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЗначениеКлассификатора</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CRM_ЗначенияКлассификаторов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/AccumulationRegisters/вогПродажи.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.10">
	<AccumulationRegister>
		<Properties>
			<Name>вогПродажи</Name>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Comment>Количество</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Стоимость</Name>
					<Comment>Стоимость</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтоимостьБезСкидок</Name>
					<Comment>Стоимость без скидок</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НДС</Name>
					<Comment>НДС</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Количество_в_единицах_отчетов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Comment>Номенклатура</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НаправлениеДеятельности</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НаправленияДеятельности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Партнер</Name>
					<Comment>Клиент</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Партнеры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТорговаяТочка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.вогТорговыеТочки</v8:Type>
						<v8:Type>cfg:CatalogRef.вогРаспределительныеЦентры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЮридическоеЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.вогЮридическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Бренд</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.вогБренды</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Производитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Партнеры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НоменклатурнаяГруппа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НоменклатурныеГруппы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

src/cf/AccumulationRegisters/вогЗатратыНаРаспродажу.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.10">
	<AccumulationRegister>
		<Properties>
			<Name>вогЗатратыНаРаспродажу</Name>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Comment>Количество</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Стоимость</Name>
					<Comment>Стоимость</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Comment>Номенклатура</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НаправлениеДеятельности</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НаправленияДеятельности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Партнер</Name>
					<Comment>Клиент</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Партнеры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТорговаяТочка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.вогТорговыеТочки</v8:Type>
						<v8:Type>cfg:CatalogRef.вогРаспределительныеЦентры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

src/cf/Catalogs/CRM_ЗначенияКлассификаторов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.10">
	<Catalog>
		<Properties>
			<Name>CRM_ЗначенияКлассификаторов</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>ChartOfCharacteristicTypes.CRM_Классификаторы</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СхемаКомпоновкиДанных</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХранилищеНастроекКомпоновкиДанных</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяШаблонаСКД</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДополнительныйРеквизит</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.CRM_ДополнительныеРеквизитыКлассификаторов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РеквизитДопУпорядочивания</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаправлениеДеятельности</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НаправленияДеятельности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаборСвойств</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НаборыДополнительныхРеквизитовИСведений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/CommonModules/вогОбщегоНазначенияКлиентСерверПовтИсп/Ext/Module.bsl
#Область РасширеннаяКарточкаОбъектов

Функция ИспользуетсяРасширеннаяКарточка(ИмяТаблицы) ЭКспорт
	
	Возврат МассивОбъектовРасширеннойКарточки().Найти(ИмяТаблицы) <> Неопределено;
	
КонецФункции // ИспользуетсяРасширеннаяКарточка()

Функция МассивОбъектовРасширеннойКарточки() Экспорт

	МассивИспользуемыхОбъектов = Новый Массив;
	МассивИспользуемыхОбъектов.Добавить("Справочник.Номенклатура");
	МассивИспользуемыхОбъектов.Добавить("Справочник.КонтактныеЛицаПартнеров");
	МассивИспользуемыхОбъектов.Добавить("Справочник.вогТорговыеТочки");
	МассивИспользуемыхОбъектов.Добавить("Справочник.вогРаспределительныеЦентры");
	МассивИспользуемыхОбъектов.Добавить("Справочник.Партнеры");
	МассивИспользуемыхОбъектов.Добавить("Справочник.вогЮридическиеЛица");

	Возврат МассивИспользуемыхОбъектов;
	
КонецФункции // МассивИспользуемыхОбъектов()

#КонецОбласти

#Область СлужебныеПроцедурыФункции

Функция ПредставлениеОбъектаКонтаткнойИнформации(ОбъектСсылка) Экспорт

	МетаданныеОбъекта = ОбъектСсылка.Метаданные();
	Возврат ?(ЗначениеЗаполнено(МетаданныеОбъекта.ПредставлениеОбъекта), МетаданныеОбъекта.ПредставлениеОбъекта, МетаданныеОбъекта.Синоним)

КонецФункции // ПредставлениеОбъектаКонтаткнойИнформации()

// ++ VOG Солодов В.В. 24.06.2020 CRM-724
Функция ПользовательЯвляетсяСобственником(Пользователь = Неопределено) Экспорт
	
	Возврат вогОбщегоНазначенияВызовСервера.ПользовательЯвляетсяСобственником(Пользователь);
	
КонецФункции
// -- VOG Солодов В.В. 24.06.2020 CRM-724

#КонецОбласти

#Область ПоискДублейОбъектов

Функция ВыполнятьПоискДублейОбъекта(Ссылка) Экспорт
	
	Возврат Истина;
	
КонецФункции // ВыполнятьПоискДублейОбъекта()

Функция СоответствиеКлючейПоискаКонтактов() Экспорт

	СоответствиеКлючейПоиска = Новый Соответствие;
	
	СоответствиеКлючейПоиска.Вставить(ПредопределенноеЗначение("Перечисление.ТипыКонтактнойИнформации.Адрес")				 , "Адрес");
	СоответствиеКлючейПоиска.Вставить(ПредопределенноеЗначение("Перечисление.ТипыКонтактнойИнформации.Телефон")				 , "Телефон");
	СоответствиеКлючейПоиска.Вставить(ПредопределенноеЗначение("Перечисление.ТипыКонтактнойИнформации.АдресЭлектроннойПочты"), "АдресЭлектроннойПочты");
	
	Возврат СоответствиеКлючейПоиска;
	
КонецФункции // СоответствиеКлючейПоискаКонтактов()

#КонецОбласти

#Если Сервер Тогда
//+++ Терпогосян Д.Б. [13.08.2021 11:31:38] № Получение данных по ценам распродажи и затратам распродажи для планирования продаж обои
	Функция ПолучитьЦеныЗатратыОбои(лДата) Экспорт
	Результат = Новый Структура("ТаблицаЦеныдляРаспродажи, ТаблицаЦеныДляРаспродажиКлиент, ТаблицаЦеныДляРаспродажиФилиал, ТаблицаЗатратыНаРаспродажу"); 
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	вогТорговыеТочки.Ссылка КАК Ссылка,
		|	вогТорговыеТочки.Наименование КАК Наименование,
		|	вогТорговыеТочки.Вид КАК Вид,
		|	вогТорговыеТочки.Партнер КАК Клиент,
		|	вогТорговыеТочки.Розничный КАК Розничный,
		|	вогТорговыеТочки.НаименованиеПолное КАК НаименованиеПолное,
		|	вогТорговыеТочки.НаселенныйПункт КАК НаселенныйПункт,
		|	вогТорговыеТочки.НаселенныйПунктРегион КАК НаселенныйПунктРегион,
		|	вогТорговыеТочки.НаселенныйПунктРайон КАК НаселенныйПунктРайон,
		|	вогТорговыеТочки.ПометкаУдаления КАК ПометкаУдаления,
		|	вогТорговыеТочки.Код КАК Код,
		|	вогМенеджерыОбъектов.Менеджер КАК МенеджерОтчет,
		|	ЕСТЬNULL(вогТорговыеТочки.ПодразделениеОтчет, вогМенеджерыОбъектов.Подразделение) КАК ПодразделениеОтчет,
		|	вогТорговыеТочки.ЕстьБрендМенеджер КАК ЕстьБрендМенеджер,
		|	вогТорговыеТочки.БрендМенеджер КАК БрендМенеджер
		|ПОМЕСТИТЬ втТорговыеТочки
		|ИЗ
		|	(ВЫБРАТЬ
		|		вогТорговыеТочки.Ссылка КАК Ссылка,
		|		вогТорговыеТочки.Наименование КАК Наименование,
		|		вогТорговыеТочки.Вид КАК Вид,
		|		вогТорговыеТочки.Партнер КАК Партнер,
		|		вогТорговыеТочки.Розничный КАК Розничный,
		|		вогТорговыеТочки.НаименованиеПолное КАК НаименованиеПолное,
		|		вогТорговыеТочки.НаселенныйПункт КАК НаселенныйПункт,
		|		вогТорговыеТочки.НаселенныйПунктРегион КАК НаселенныйПунктРегион,
		|		вогТорговыеТочки.НаселенныйПунктРайон КАК НаселенныйПунктРайон,
		|		вогТорговыеТочки.ПометкаУдаления КАК ПометкаУдаления,
		|		вогТорговыеТочки.Код КАК Код,
		|		ПодразделенияТорговыхТочек.Подразделение КАК ПодразделениеОтчет,
		|		ЕСТЬNULL(ПодразделенияТорговыхТочек.ЕстьБрендМенеджер, ЛОЖЬ) КАК ЕстьБрендМенеджер,
		|		ЕСТЬNULL(ПодразделенияТорговыхТочек.БрендМенеджер, ЛОЖЬ) КАК БрендМенеджер
		|	ИЗ
		|		Справочник.вогТорговыеТочки КАК вогТорговыеТочки
		|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПодразделенияТорговыхТочек КАК ПодразделенияТорговыхТочек
		|			ПО вогТорговыеТочки.Ссылка = ПодразделенияТорговыхТочек.ТорговаяТочка
		|				И (ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.Обои) = ПодразделенияТорговыхТочек.Направление)) КАК вогТорговыеТочки
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.вогМенеджерыОбъектов КАК вогМенеджерыОбъектов
		|		ПО вогТорговыеТочки.Ссылка = вогМенеджерыОбъектов.Владелец
		|			И (ЗНАЧЕНИЕ(Справочник.РолиКонтактныхЛицПартнеров.Менеджер) = вогМенеджерыОбъектов.Роль)
		|			И (ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.Обои) = вогМенеджерыОбъектов.НаправлениеДеятельности)
		|			И вогТорговыеТочки.ПодразделениеОтчет = вогМенеджерыОбъектов.Подразделение
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.CRM_ОбъектыЗначенийКлассификаторов КАК КлассификаторСтатусТТ
		|		ПО вогТорговыеТочки.Ссылка = КлассификаторСтатусТТ.Объект
		|			И (&КлассификаторСтатусТТ = КлассификаторСтатусТТ.ЗначениеКлассификатора.Владелец)
		|ГДЕ
		|	КлассификаторСтатусТТ.ЗначениеКлассификатора <> &СтатусТТЗакрыта
		|	И вогТорговыеТочки.Вид <> ЗНАЧЕНИЕ(Справочник.вогВидыТорговыхТочек.РазовыйПокупатель)
		|	И вогТорговыеТочки.Вид <> ЗНАЧЕНИЕ(Справочник.вогВидыТорговыхТочек.ТРТД)
		|	И НЕ вогТорговыеТочки.Розничный
		|	И НЕ вогТорговыеТочки.ПометкаУдаления
		|	И ЕСТЬNULL(вогТорговыеТочки.ПодразделениеОтчет, ЕСТЬNULL(вогМенеджерыОбъектов.Подразделение, НЕОПРЕДЕЛЕНО)) <> НЕОПРЕДЕЛЕНО
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	вогПродажиОбороты.Подразделение КАК Подразделение,
		|	вогПродажиОбороты.СтоимостьОборот - вогПродажиОбороты.НДСОборот КАК Стоимость1,
		|	вогПродажиОбороты.КоличествоОборот КАК Количество1,
		|	0 КАК Стоимость05,
		|	0 КАК Количество05,
		|	вогПродажиОбороты.ТорговаяТочка КАК ТорговаяТочка,
		|	вогПродажиОбороты.Партнер КАК Партнер
		|ПОМЕСТИТЬ втПродажиЗаПоследнийГод
		|ИЗ
		|	РегистрНакопления.вогПродажи.Обороты(
		|			&ПрошлыйГод,
		|			&КонецПрошлогоМесяца,
		|			День,
		|			НаправлениеДеятельности = ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.Обои)
		|				И ТорговаяТочка В
		|					(ВЫБРАТЬ
		|						втТорговыеТочки.Ссылка КАК Ссылка
		|					ИЗ
		|						втТорговыеТочки КАК втТорговыеТочки)
		|				И Номенклатура.НоменклатурнаяПозиция.Дизайн.ТипНоменклатуры.Ширина = 1.06) КАК вогПродажиОбороты
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	вогПродажиОбороты.Подразделение,
		|	0,
		|	0,
		|	вогПродажиОбороты.СтоимостьОборот - вогПродажиОбороты.НДСОборот,
		|	вогПродажиОбороты.КоличествоОборот,
		|	вогПродажиОбороты.ТорговаяТочка,
		|	вогПродажиОбороты.Партнер
		|ИЗ
		|	РегистрНакопления.вогПродажи.Обороты(
		|			&ПрошлыйГод,
		|			&КонецПрошлогоМесяца,
		|			День,
		|			НаправлениеДеятельности = ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.Обои)
		|				И ТорговаяТочка В
		|					(ВЫБРАТЬ
		|						втТорговыеТочки.Ссылка КАК Ссылка
		|					ИЗ
		|						втТорговыеТочки КАК втТорговыеТочки)
		|				И Номенклатура.НоменклатурнаяПозиция.Дизайн.ТипНоменклатуры.Ширина = 0.53) КАК вогПродажиОбороты
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	втПродажиЗаПоследнийГод.Подразделение КАК Подразделение,
		|	СУММА(втПродажиЗаПоследнийГод.Стоимость1) КАК Стоимость1,
		|	СУММА(втПродажиЗаПоследнийГод.Количество1) КАК Количество1,
		|	СУММА(втПродажиЗаПоследнийГод.Стоимость05) КАК Стоимость05,
		|	СУММА(втПродажиЗаПоследнийГод.Количество05) КАК Количество05,
		|	втПродажиЗаПоследнийГод.ТорговаяТочка КАК ТорговаяТочка
		|ПОМЕСТИТЬ втСредниеПродажи
		|ИЗ
		|	втПродажиЗаПоследнийГод КАК втПродажиЗаПоследнийГод
		|
		|СГРУППИРОВАТЬ ПО
		|	втПродажиЗаПоследнийГод.Подразделение,
		|	втПродажиЗаПоследнийГод.ТорговаяТочка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	втТорговыеТочки.ПодразделениеОтчет КАК Подразделение,
		|	втТорговыеТочки.Ссылка КАК ТорговаяТочка,
		|	ЕСТЬNULL(ВЫБОР
		|			КОГДА втСредниеПродажи.Количество1 = 0
		|				ТОГДА 0
		|			ИНАЧЕ втСредниеПродажи.Стоимость1 / втСредниеПродажи.Количество1
		|		КОНЕЦ, 0) КАК СредняяЦена1,
		|	ЕСТЬNULL(ВЫБОР
		|			КОГДА втСредниеПродажи.Количество05 = 0
		|				ТОГДА 0
		|			ИНАЧЕ втСредниеПродажи.Стоимость05 / втСредниеПродажи.Количество05
		|		КОНЕЦ, 0) КАК СредняяЦена05
		|ИЗ
		|	втТорговыеТочки КАК втТорговыеТочки
		|		ЛЕВОЕ СОЕДИНЕНИЕ втСредниеПродажи КАК втСредниеПродажи
		|		ПО втТорговыеТочки.ПодразделениеОтчет = втСредниеПродажи.Подразделение
		|			И втТорговыеТочки.Ссылка = втСредниеПродажи.ТорговаяТочка";
	
	
	КлассификаторСтатусТРТ = ПланыВидовХарактеристик.CRM_Классификаторы.ПолучитьСсылку(Новый УникальныйИдентификатор("dcdbe20f-9a73-11e8-89fa-005056bc3fe8"));
	Запрос.УстановитьПараметр("КлассификаторСтатусТТ", КлассификаторСтатусТРТ);
	Запрос.УстановитьПараметр("КонецПрошлогоМесяца", КонецМесяца(ДобавитьМесяц(лДата,-1)));
	Запрос.УстановитьПараметр("ПрошлыйГод", НачалоМесяца(ДобавитьМесяц(лДата,-12)));
	СтатусТТЗакрыта = Справочники.CRM_ЗначенияКлассификаторов.ПолучитьСсылку(Новый УникальныйИдентификатор("005e9af3-9a74-11e8-89fa-005056bc3fe8"));
	Запрос.УстановитьПараметр("СтатусТТЗакрыта", СтатусТТЗакрыта);
	
	Результат.ТаблицаЦеныдляРаспродажи = Запрос.Выполнить().Выгрузить();
	
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	вогПродажиОбороты.Подразделение КАК Подразделение,
	               |	вогПродажиОбороты.СтоимостьОборот - вогПродажиОбороты.НДСОборот КАК Стоимость1,
	               |	вогПродажиОбороты.КоличествоОборот КАК Количество1,
	               |	0 КАК Стоимость05,
	               |	0 КАК Количество05,
	               |	вогПродажиОбороты.Партнер КАК Партнер
	               |ПОМЕСТИТЬ втПродажиЗаПоследнийГод
	               |ИЗ
	               |	РегистрНакопления.вогПродажи.Обороты(
	               |			&ПрошлыйГод,
	               |			&КонецПрошлогоМесяца,
	               |			День,
	               |			НаправлениеДеятельности = ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.Обои)
	               |				И Номенклатура.НоменклатурнаяПозиция.Дизайн.ТипНоменклатуры.Ширина = 1.06
	               |				И ТорговаяТочка.Вид <> ЗНАЧЕНИЕ(Справочник.вогВидыТорговыхТочек.РазовыйПокупатель)
	               |				И ТорговаяТочка.Вид <> ЗНАЧЕНИЕ(Справочник.вогВидыТорговыхТочек.ТРТД)
	               |				И НЕ ТорговаяТочка.Розничный
	               |				И НЕ ТорговаяТочка.ПометкаУдаления) КАК вогПродажиОбороты
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.CRM_ОбъектыЗначенийКлассификаторов КАК КлассификаторСтатусТТ
	               |		ПО вогПродажиОбороты.ТорговаяТочка = КлассификаторСтатусТТ.Объект
	               |			И (&КлассификаторСтатусТТ = КлассификаторСтатусТТ.ЗначениеКлассификатора.Владелец)
	               |ГДЕ
	               |	КлассификаторСтатусТТ.ЗначениеКлассификатора <> &СтатусТТЗакрыта
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	вогПродажиОбороты.Подразделение,
	               |	0,
	               |	0,
	               |	вогПродажиОбороты.СтоимостьОборот - вогПродажиОбороты.НДСОборот,
	               |	вогПродажиОбороты.КоличествоОборот,
	               |	вогПродажиОбороты.Партнер
	               |ИЗ
	               |	РегистрНакопления.вогПродажи.Обороты(
	               |			&ПрошлыйГод,
	               |			&КонецПрошлогоМесяца,
	               |			День,
	               |			НаправлениеДеятельности = ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.Обои)
	               |				И Номенклатура.НоменклатурнаяПозиция.Дизайн.ТипНоменклатуры.Ширина = 0.53
	               |				И ТорговаяТочка.Вид <> ЗНАЧЕНИЕ(Справочник.вогВидыТорговыхТочек.РазовыйПокупатель)
	               |				И ТорговаяТочка.Вид <> ЗНАЧЕНИЕ(Справочник.вогВидыТорговыхТочек.ТРТД)
	               |				И НЕ ТорговаяТочка.Розничный
	               |				И НЕ ТорговаяТочка.ПометкаУдаления) КАК вогПродажиОбороты
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.CRM_ОбъектыЗначенийКлассификаторов КАК КлассификаторСтатусТТ
	               |		ПО вогПродажиОбороты.ТорговаяТочка = КлассификаторСтатусТТ.Объект
	               |			И (&КлассификаторСтатусТТ = КлассификаторСтатусТТ.ЗначениеКлассификатора.Владелец)
	               |ГДЕ
	               |	КлассификаторСтатусТТ.ЗначениеКлассификатора <> &СтатусТТЗакрыта
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	втПродажиЗаПоследнийГод.Подразделение КАК Подразделение,
	               |	СУММА(втПродажиЗаПоследнийГод.Стоимость1) КАК Стоимость1,
	               |	СУММА(втПродажиЗаПоследнийГод.Количество1) КАК Количество1,
	               |	СУММА(втПродажиЗаПоследнийГод.Стоимость05) КАК Стоимость05,
	               |	СУММА(втПродажиЗаПоследнийГод.Количество05) КАК Количество05,
	               |	втПродажиЗаПоследнийГод.Партнер КАК Партнер
	               |ПОМЕСТИТЬ втСредниеПродажиПоКлиенту
	               |ИЗ
	               |	втПродажиЗаПоследнийГод КАК втПродажиЗаПоследнийГод
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	втПродажиЗаПоследнийГод.Подразделение,
	               |	втПродажиЗаПоследнийГод.Партнер
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	ЕСТЬNULL(ВЫБОР
	               |			КОГДА втСредниеПродажиПоКлиенту.Количество1 = 0
	               |				ТОГДА 0
	               |			ИНАЧЕ втСредниеПродажиПоКлиенту.Стоимость1 / втСредниеПродажиПоКлиенту.Количество1
	               |		КОНЕЦ, 0) КАК СредняяЦена1,
	               |	ЕСТЬNULL(ВЫБОР
	               |			КОГДА втСредниеПродажиПоКлиенту.Количество05 = 0
	               |				ТОГДА 0
	               |			ИНАЧЕ втСредниеПродажиПоКлиенту.Стоимость05 / втСредниеПродажиПоКлиенту.Количество05
	               |		КОНЕЦ, 0) КАК СредняяЦена05,
	               |	втСредниеПродажиПоКлиенту.Подразделение КАК Подразделение,
	               |	втСредниеПродажиПоКлиенту.Партнер КАК Клиент
	               |ИЗ
	               |	втСредниеПродажиПоКлиенту КАК втСредниеПродажиПоКлиенту";
	
	УстановитьПривилегированныйРежим(Истина);
	Результат.ТаблицаЦеныДляРаспродажиКлиент = Запрос.Выполнить().Выгрузить(); 
	УстановитьПривилегированныйРежим(Ложь);
	
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	вогПродажиОбороты.Подразделение КАК Подразделение,
	               |	вогПродажиОбороты.СтоимостьОборот - вогПродажиОбороты.НДСОборот КАК Стоимость1,
	               |	вогПродажиОбороты.КоличествоОборот КАК Количество1,
	               |	0 КАК Стоимость05,
	               |	0 КАК Количество05
	               |ПОМЕСТИТЬ втПродажиЗаПоследнийГод
	               |ИЗ
	               |	РегистрНакопления.вогПродажи.Обороты(
	               |			&ПрошлыйГод,
	               |			&КонецПрошлогоМесяца,
	               |			День,
	               |			НаправлениеДеятельности = ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.Обои)
	               |				И Номенклатура.НоменклатурнаяПозиция.Дизайн.ТипНоменклатуры.Ширина = 1.06
	               |				И ТорговаяТочка.Вид <> ЗНАЧЕНИЕ(Справочник.вогВидыТорговыхТочек.РазовыйПокупатель)
	               |				И ТорговаяТочка.Вид <> ЗНАЧЕНИЕ(Справочник.вогВидыТорговыхТочек.ТРТД)
	               |				И НЕ ТорговаяТочка.Розничный
	               |				И НЕ ТорговаяТочка.ПометкаУдаления) КАК вогПродажиОбороты
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.CRM_ОбъектыЗначенийКлассификаторов КАК КлассификаторСтатусТТ
	               |		ПО вогПродажиОбороты.ТорговаяТочка = КлассификаторСтатусТТ.Объект
	               |			И (&КлассификаторСтатусТТ = КлассификаторСтатусТТ.ЗначениеКлассификатора.Владелец)
	               |ГДЕ
	               |	КлассификаторСтатусТТ.ЗначениеКлассификатора <> &СтатусТТЗакрыта
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	вогПродажиОбороты.Подразделение,
	               |	0,
	               |	0,
	               |	вогПродажиОбороты.СтоимостьОборот - вогПродажиОбороты.НДСОборот,
	               |	вогПродажиОбороты.КоличествоОборот
	               |ИЗ
	               |	РегистрНакопления.вогПродажи.Обороты(
	               |			&ПрошлыйГод,
	               |			&КонецПрошлогоМесяца,
	               |			День,
	               |			НаправлениеДеятельности = ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.Обои)
	               |				И Номенклатура.НоменклатурнаяПозиция.Дизайн.ТипНоменклатуры.Ширина = 0.53
	               |				И ТорговаяТочка.Вид <> ЗНАЧЕНИЕ(Справочник.вогВидыТорговыхТочек.РазовыйПокупатель)
	               |				И ТорговаяТочка.Вид <> ЗНАЧЕНИЕ(Справочник.вогВидыТорговыхТочек.ТРТД)
	               |				И НЕ ТорговаяТочка.Розничный
	               |				И НЕ ТорговаяТочка.ПометкаУдаления) КАК вогПродажиОбороты
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.CRM_ОбъектыЗначенийКлассификаторов КАК КлассификаторСтатусТТ
	               |		ПО вогПродажиОбороты.ТорговаяТочка = КлассификаторСтатусТТ.Объект
	               |			И (&КлассификаторСтатусТТ = КлассификаторСтатусТТ.ЗначениеКлассификатора.Владелец)
	               |ГДЕ
	               |	КлассификаторСтатусТТ.ЗначениеКлассификатора <> &СтатусТТЗакрыта
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	втПродажиЗаПоследнийГод.Подразделение КАК Подразделение,
	               |	СУММА(втПродажиЗаПоследнийГод.Стоимость1) КАК Стоимость1,
	               |	СУММА(втПродажиЗаПоследнийГод.Количество1) КАК Количество1,
	               |	СУММА(втПродажиЗаПоследнийГод.Стоимость05) КАК Стоимость05,
	               |	СУММА(втПродажиЗаПоследнийГод.Количество05) КАК Количество05
	               |ПОМЕСТИТЬ втСредниеПродажиПоКлиенту
	               |ИЗ
	               |	втПродажиЗаПоследнийГод КАК втПродажиЗаПоследнийГод
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	втПродажиЗаПоследнийГод.Подразделение
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	ЕСТЬNULL(ВЫБОР
	               |			КОГДА втСредниеПродажиПоКлиенту.Количество1 = 0
	               |				ТОГДА 0
	               |			ИНАЧЕ втСредниеПродажиПоКлиенту.Стоимость1 / втСредниеПродажиПоКлиенту.Количество1
	               |		КОНЕЦ, 0) КАК СредняяЦена1,
	               |	ЕСТЬNULL(ВЫБОР
	               |			КОГДА втСредниеПродажиПоКлиенту.Количество05 = 0
	               |				ТОГДА 0
	               |			ИНАЧЕ втСредниеПродажиПоКлиенту.Стоимость05 / втСредниеПродажиПоКлиенту.Количество05
	               |		КОНЕЦ, 0) КАК СредняяЦена05,
	               |	втСредниеПродажиПоКлиенту.Подразделение КАК Подразделение
	               |ИЗ
	               |	втСредниеПродажиПоКлиенту КАК втСредниеПродажиПоКлиенту";
	
	УстановитьПривилегированныйРежим(Истина);
	Результат.ТаблицаЦеныДляРаспродажиФилиал = Запрос.Выполнить().Выгрузить();
	УстановитьПривилегированныйРежим(Ложь);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СУММА(вогЗатратыНаРаспродажуОбороты.КоличествоОборот) КАК КоличествоОборот,
		|	СУММА(вогЗатратыНаРаспродажуОбороты.СтоимостьОборот) КАК СтоимостьОборот,
		|	ВЫБОР
		|		КОГДА вогЗатратыНаРаспродажуОбороты.Подразделение = &ПодразделениеКМВ
		|			ТОГДА &ПодразделениеРостов
		|		ИНАЧЕ вогЗатратыНаРаспродажуОбороты.Подразделение
		|	КОНЕЦ КАК Подразделение
		|ПОМЕСТИТЬ втЗатратыНаРаспродажу
		|ИЗ
		|	РегистрНакопления.вогЗатратыНаРаспродажу.Обороты(&Начало3Месяца, &Конец3Месяца, , НаправлениеДеятельности = ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.Обои)) КАК вогЗатратыНаРаспродажуОбороты
		|
		|СГРУППИРОВАТЬ ПО
		|	ВЫБОР
		|		КОГДА вогЗатратыНаРаспродажуОбороты.Подразделение = &ПодразделениеКМВ
		|			ТОГДА &ПодразделениеРостов
		|		ИНАЧЕ вогЗатратыНаРаспродажуОбороты.Подразделение
		|	КОНЕЦ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВЫБОР
		|		КОГДА втЗатратыНаРаспродажу.КоличествоОборот = 0
		|			ТОГДА 0
		|		ИНАЧЕ втЗатратыНаРаспродажу.СтоимостьОборот / втЗатратыНаРаспродажу.КоличествоОборот
		|	КОНЕЦ КАК ЗатратыНаРаспродажу,
		|	втЗатратыНаРаспродажу.Подразделение КАК Подразделение
		|ИЗ
		|	втЗатратыНаРаспродажу КАК втЗатратыНаРаспродажу";
	
	Запрос.УстановитьПараметр("Конец3Месяца", КонецМесяца(ДобавитьМесяц(лДата,-1)));
	Запрос.УстановитьПараметр("Начало3Месяца", НачалоМесяца(ДобавитьМесяц(лДата,-3)));
	ПодразделениеКМВ = Справочники.СтруктураПредприятия.ПолучитьСсылку(Новый УникальныйИдентификатор("3000815c-66e6-11e3-9235-00155d66c603"));
	ПодразделениеРостов = Справочники.СтруктураПредприятия.ПолучитьСсылку(Новый УникальныйИдентификатор("9f82aafb-3b61-11e9-b0ca-005056bcd3e3"));
	Запрос.УстановитьПараметр("ПодразделениеКМВ", ПодразделениеКМВ);
	Запрос.УстановитьПараметр("ПодразделениеРостов", ПодразделениеРостов);
	
	Результат.ТаблицаЗатратыНаРаспродажу = Запрос.Выполнить().Выгрузить();
	
	Возврат Результат
Конецфункции
//--- Терпогосян Д.Б. [13.08.2021 11:31:39] №   
#КонецЕсли
